#include"temp.h"
#include <intrins.h>
/*******************************************************************************
* 函 数 名         : Delay1ms
* 函数功能		   : 延时函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void Delay_DS18B20(int num)
{
  while(num--) ;
}

void Delay1ms(u16 y)
{
	u16 x;
	for( ; y>0; y--)
	{
		for(x=110; x>0; x--);
	}
}
/*******************************************************************************
* 函 数 名         : Ds18b20Init
* 函数功能		   : 初始化
* 输    入         : 无
* 输    出         : 初始化成功返回1，失败返回0
*******************************************************************************/

u8 Ds18b20Init()
{
  unsigned char x=0;
  DSPORT = 1;         //DQ复位
  Delay_DS18B20(8);    //稍做延时
  DSPORT = 0;         //单片机将DQ拉低
  Delay_DS18B20(80);   //精确延时，大于480us
  DSPORT = 1;         //拉高总线
  Delay_DS18B20(14);
  x = DSPORT;           //稍做延时后，如果x=0则初始化成功，x=1则初始化失败
  Delay_DS18B20(20);
  return x;
}
/*****************************************************************
* 函 数 名         : Ds18b20WriteByte
* 函数功能		   : 向18B20写入一个字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void Ds18b20WriteByte(u8 dat)
{
  unsigned char i=0;
  for (i=8; i>0; i--)
  {
    DSPORT = 0;
    DSPORT = dat&0x01;
    Delay_DS18B20(5);
    DSPORT = 1;
    dat>>=1;
  }
}
/*******************************************************************************
* 函 数 名         : Ds18b20ReadByte
* 函数功能		   : 读取一个字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/


u8 Ds18b20ReadByte()
{
  unsigned char i=0;
  unsigned char byte = 0;
  for (i=8;i>0;i--)
  {
    DSPORT = 0;     // 给脉冲信号
    byte>>=1;
    DSPORT = 1;     // 给脉冲信号
    if(DSPORT)
    byte|=0x80;
    Delay_DS18B20(4);
  }
  return(byte);
}
/*******************************************************************************
* 函 数 名         : Ds18b20ChangTemp
* 函数功能		   : 让18b20开始转换温度
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void  Ds18b20ChangTemp()
{
	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteByte(0xcc);		//跳过ROM操作命令		 
	Ds18b20WriteByte(0x44);	    //温度转换命令
	Delay1ms(100);	//等待转换成功，而如果你是一直刷着的话，就不用这个延时了
   
}
/*******************************************************************************
* 函 数 名         : Ds18b20ReadTempCom
* 函数功能		   : 发送读取温度命令
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void Ds18b20ReadTempCom()
{	

	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteByte(0xcc);	 //跳过ROM操作命令
	Ds18b20WriteByte(0xbe);	 //发送读取温度命令
}
/*******************************************************************************
* 函 数 名         : Ds18b20ReadTemp
* 函数功能		   : 读取温度
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

unsigned int Ds18b20ReadTemp()
{
  unsigned char a=0;
  unsigned char b=0;
  unsigned int t=0;
  float tt=0;
  Ds18b20Init();
  Ds18b20WriteByte(0xCC);  //跳过读序号列号的操作
  Ds18b20WriteByte(0x44);  //启动温度转换
  Ds18b20Init();
  Ds18b20WriteByte(0xCC);  //跳过读序号列号的操作
  Ds18b20WriteByte(0xBE);  //读取温度寄存器
  a=Ds18b20ReadByte();     //读低8位
  b=Ds18b20ReadByte();    //读高8位
  t=b;				   //高8位转移到t
  t<<=8;			   //t数据左移8位
  t=t|a;			   //将t和a按位或，得到一个16位的数
  tt=t*0.0625;		   //将t乘以0.0625得到实际温度值（温度传感器设置12位精度，最小分辨率是0.0625）
  t= tt*10+0.5;     //放大10倍（将小数点后一位显示出来）输出并四舍五入
  return(t);		   //返回温度值
}